Import the pandas library  
Read the data company.csv in pandas

In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv('company.csv')
dataset

     Company   Age  Salary     Place Country  Gender
0        TCS  20.0     NaN   Chennai   India       0
1    Infosys  30.0     NaN    Mumbai   India       0
2        TCS  35.0  2300.0  Calcutta   India       0
3    Infosys  40.0  3000.0     Delhi   India       0
4        TCS  23.0  4000.0    Mumbai   India       0
..       ...   ...     ...       ...     ...     ...
143      TCS  33.0  9024.0  Calcutta   India       1
144  Infosys  22.0  8787.0  Calcutta   India       1
145  Infosys  44.0  4034.0     Delhi   India       1
146      TCS  33.0  5034.0    Mumbai   India       1
147  Infosys  22.0  8202.0    Cochin   India       0

[148 rows x 6 columns]

Find the dimension of given data

In [3]:
dataset.shape

(148, 6)

List down all the columns in data frame

In [4]:
dataset.columns

Index(['Company', 'Age', 'Salary', 'Place', 'Country', 'Gender'], dtype='object')

List the top 10 rows in datframe

In [5]:
dataset.head(10)

   Company   Age  Salary     Place Country  Gender
0      TCS  20.0     NaN   Chennai   India       0
1  Infosys  30.0     NaN    Mumbai   India       0
2      TCS  35.0  2300.0  Calcutta   India       0
3  Infosys  40.0  3000.0     Delhi   India       0
4      TCS  23.0  4000.0    Mumbai   India       0
5  Infosys   NaN  5000.0  Calcutta   India       0
6      TCS   NaN  6000.0   Chennai   India       1
7  Infosys  23.0  7000.0    Mumbai   India       1
8      TCS  34.0  8000.0  Calcutta   India       1
9      CTS  45.0  9000.0     Delhi   India       0

List the last 15 rows in datframe

In [6]:
dataset.tail(15)

                       Company   Age  Salary      Place Country  Gender
133                        NaN  22.0  8943.0    Chennai   India       0
134  Tata Consultancy Services  31.0  8345.0     Mumbai   India       0
135                        CTS  40.0  9284.0   Calcutta   India       1
136                        NaN   NaN     NaN      Delhi   India       0
137                        CTS  31.0  2034.0     Mumbai   India       0
138                        CTS  44.0  3033.0     Cochin   India       0
139                 Congnizant  22.0  2934.0      Noida   India       0
140                    Infosys  44.0  4034.0  Hyderabad   India       0
141                        TCS  33.0  5034.0   Calcutta   India       0
142            Infosys Pvt Lmt  22.0  8202.0     Mumbai   India       0
143                        TCS  33.0  9024.0   Calcutta   India       1
144                    Infosys  22.0  8787.0   Calcutta   India       1
145                    Infosys  44.0  4034.0      Delhi   India       1
146                        TCS  33.0  5034.0     Mumbai   India       1
147                    Infosys  22.0  8202.0     Cochin   India       0

Find the number of rows in dataframe

In [7]:
dataset.shape[0]

148

Check the information of dataframe

In [8]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  140 non-null    object
 1   Age      130 non-null    float64
 2   Salary   124 non-null    float64
 3   Place    134 non-null    object
 4   Country  148 non-null    object
 5   Gender   148 non-null    int64
dtypes: float64(2), int64(1), object(3)
memory usage: 7.1+ KB

Check the basic Statistics of Dataframe. Give your inference from the stats

In [9]:
dataset.describe()

              Age       Salary      Gender
count  130.000000   124.000000  148.000000
mean    30.484615  5312.467742    0.222973
std     11.096640  2573.764683    0.417654
min      0.000000  1089.000000    0.000000
25%     22.000000  3030.000000    0.000000
50%     32.500000  5000.000000    0.000000
75%     37.750000  8000.000000    0.000000
max     54.000000  9876.000000    1.000000

Retrieve 20 to 100 rows and Company and age usig iloc

In [10]:
dataset.iloc[20:101,0:2]

     Company   Age
20       TCS  37.0
21   Infosys  50.0
22       TCS  21.0
23   Infosys   NaN
24       TCS   NaN
..       ...   ...
96       TCS   NaN
97   Infosys  22.0
98       TCS  33.0
99       CTS  44.0
100      CTS  22.0

[81 rows x 2 columns]

Retrieve 20 to 100 rows and Company and age usig loc

In [11]:
dataset.loc[20:101,['Company','Age']]

     Company   Age
20       TCS  37.0
21   Infosys  50.0
22       TCS  21.0
23   Infosys   NaN
24       TCS   NaN
..       ...   ...
97   Infosys  22.0
98       TCS  33.0
99       CTS  44.0
100      CTS  22.0
101      CTS   0.0

[82 rows x 2 columns]

Chage the data in 100 row and Place as 'Noida'

In [12]:
dataset.loc[100].replace("Cochin","Noida")

Company      CTS
Age           22
Salary       NaN
Place      Noida
Country    India
Gender         0
Name: 100, dtype: object

Change the column 'Place' to 'City'

In [13]:
dataset.rename(columns={'Place':'City'}, inplace = True)

List down the unique data in each columns and find length of unique data

In [14]:
dataset.columns.unique()

Index(['Company', 'Age', 'Salary', 'City', 'Country', 'Gender'], dtype='object')

In [15]:
dataset["Company"].value_counts()

TCS                          53
Infosys                      45
CTS                          36
Infosys Pvt Lmt               2
Tata Consultancy Services     2
Congnizant                    2
Name: Company, dtype: int64

Rename all the possible labels of column in Company as three labels
TCS
CTS
Infosys

In [16]:
dataset["Company"].replace({"Tata Consultancy Services":"TCS", "Congnizant" : "CTS" , "Infosys Pvt Lmt" : "Infosys"},inplace= True)

In [17]:
dataset["Company"].value_counts()

TCS        55
Infosys    47
CTS        38
Name: Company, dtype: int64

Where ever you see age as 0 replace with NA

##Hint df[df.Age==20] = np.isnan

In [18]:
dataset['Age'].value_counts()

22.0    16
33.0    13
44.0    10
21.0     8
23.0     8
34.0     8
32.0     7
35.0     6
0.0      6
41.0     5
45.0     4
43.0     4
24.0     4
36.0     3
40.0     3
20.0     3
25.0     3
31.0     3
46.0     2
50.0     2
37.0     2
26.0     2
30.0     2
18.0     1
19.0     1
38.0     1
51.0     1
17.0     1
54.0     1
Name: Age, dtype: int64

Check how many duplicated data is there?

In [19]:
import numpy as np
dataset['Age'].replace(np.nan, 'NA', inplace=True)

Remove all duplicated rowise data

In [20]:
df = dataset.drop_duplicates()

In [24]:
len(df[df.duplicated()])

0

Remove the column 'Country'

In [25]:
dataset.drop('Country',axis = 'columns')

     Company Age  Salary      City  Gender
0        TCS  20     NaN   Chennai       0
1    Infosys  30     NaN    Mumbai       0
2        TCS  35  2300.0  Calcutta       0
3    Infosys  40  3000.0     Delhi       0
4        TCS  23  4000.0    Mumbai       0
..       ...  ..     ...       ...     ...
143      TCS  33  9024.0  Calcutta       1
144  Infosys  22  8787.0  Calcutta       1
145  Infosys  44  4034.0     Delhi       1
146      TCS  33  5034.0    Mumbai       1
147  Infosys  22  8202.0    Cochin       0

[148 rows x 5 columns]

Remove the row number 137

In [26]:
dataset=dataset.drop(137)

Find number of each labels in Company

In [27]:
dataset['Company'].value_counts()

TCS        55
Infosys    47
CTS        37
Name: Company, dtype: int64

Find number of each labels in City

In [28]:
dataset["City"].value_counts()

Mumbai        36
Calcutta      33
Delhi         14
Chennai       14
Cochin        13
Noida          8
Hyderabad      8
Podicherry     3
Pune           2
Bhopal         1
Nagpur         1
Name: City, dtype: int64

Find Number of Null Values in each column

In [29]:
dataset.isna().sum()

Company     8
Age         0
Salary     24
City       14
Country     0
Gender      0
dtype: int64

Remove all Null values in Salary

In [30]:
dataset.dropna(subset = ['Salary'], inplace=True)

Replace the Null values in Comapany with mode

In [31]:
dataset['Company'].fillna(dataset['Company'].mode()[0],inplace= True)

Replace the null value in Salary with median

In [32]:
dataset['Salary'].fillna(dataset['Salary'].median(),inplace= True)

In [33]:
dataset['Salary'].isna().sum()

0

Replace the null value in age with mean

Filter the data with age>40 and Salary<5000

In [34]:
dataset[(dataset['Age'] > 40) & (dataset['Salary'] < 5000)]

TypeError: '>' not supported between instances of 'str' and 'int'

Draw an histogram chart for age, Salary

Draw the pie chart for place and Company

Find the mean, count, median of salary with repective to the place

Find the mean age with repective to the Company

In [ ]:
dataset